<?php
namespace addons\swiftfin\config\mt5xx;

function getChoiceScheme($tag, $keys) {
	$tagScheme = [
		'12a' => [
			'A' => [
				'name'   => 'A',
				'mask'   => ':4!c/[8c]/30x',
				'scheme' => [
					[
						'label'  => 'Определитель',
						'strict' => ['CLAS']
					],
					[
						'label' => 'Система кодировки',
					],
					[
						'label' => 'Код или описание инструмента',
					],
				]
			],
			'B' => [
				'name'   => 'B',
				'mask'   => ':4!c/[8c]/4!c',
				'scheme' => [
					[
						'label' => 'Определитель',
						'strict' => ['OPST', 'OPTI']
					],
					[
						'label' => 'Система кодировки',
					],
					[
						'label' => 'Код типа инструмента',
					],
				]
			],
			'C' => [
				'name'   => 'C',
				'mask'   => ':4!c//6!c',
				'scheme' => [
					[
						'label' => 'Определитель',
						'strict' => ['CLAS']
					],
					[
						'label' => 'Код CFI',
					],
				]
			],
		],
		'13a' => [
			'A' => [
				'name'   => 'A',
				'mask'   => ':4!c//3!c',
				'scheme' => [
					[
						'label'  => 'Определитель',
//						'strict' => ['LINK'], // в разных форматах по разному
					],
					[
						'label' => 'Определение номера',
					],
				]
			],
			'B' => [
				'name'   => 'B',
				'mask'   => ':4!c/[8c]/30x',
				'scheme' => [
					[
						'label'  => 'Определитель',
//						'strict' => ['LINK'], // в разных форматах по разному
					],
					[
						'label' => 'Система кодировки',
					],
					[
						'label' => 'Номер',
					]
				]
			]
		],
		'22a' => [
			'F' => [
				'name'   => 'F',
				'mask'   => ':4!c/[8c]/4!c',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Система кодировки',
					],
					[
						'label' => 'Признак',
					]
				]
			],
			'H' => [
				'name'   => 'H',
				'mask'   => ':4!c//4!c',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Признак',
					]
				]
			]
		],
		'69a' => [
			'A' => [
				'name'   => 'A',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Дата',
					],
					[
						'label' => 'Дата',
					],
				]
			],
			'B' => [
				'name'   => 'B',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Дата',
					],
					[
						'label' => 'Время',
					],
					[
						'label' => 'Дата',
					],
					[
						'label' => 'Время',
					],
				]
			],
			'C' => [
				'name'   => 'C',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Дата',
					],
					[
						'label' => 'Время',
					],
					[
						'label' => 'Дата',
					],
					[
						'label' => 'Время',
					],
				]
			],
			'D' => [
				'name'   => 'D',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Дата',
					],
					[
						'label' => 'Время',
					],
					[
						'label' => 'Код даты',
					],
				]
			],
			'E' => [
				'name'   => 'E',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Код даты',
					],
					[
						'label' => 'Дата',
					],
				]
			],
			'F' => [
				'name'   => 'F',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Код даты',
					],
					[
						'label' => 'Дата',
					],
					[
						'label' => 'Время',
					],
				]
			],
			'J' => [
				'name'   => 'J',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Код даты',
					],
				]
			],
		],
		'70a' => [
			'C' => [
				'name'   => 'C',
				'mask'   => ':4!c//4*35x',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Свободный текст',
					],
				]
			],
			'D' => [
				'name'   => 'D',
				'mask'   => ':4!c//6*35x',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Свободный текст',
					],
				]
			],
			'E' => [
				'name'   => 'E',
				'mask'   => ':4!c//10*35x',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Свободный текст',
					],
				]
			],
			'G' => [
				'name'   => 'G',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Свободный текст',
					],
				]
			],
		],
		'90a' => [
			'A' => [
				'name'   => 'A',
				'mask'   => ':4!c//4!c/15d',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Код типа процентов',
					],
					[
						'label' => 'Цена',
					],
				]
			],
			'B' => [
				'name'   => 'B',
				'mask'   => ':4!c~//4!c~/3!a~15d',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Код типа суммы',
					],
					[
						'label' => 'Код валюты',
					],
					[
						'label' => 'Цена',
					],
				]
			],
			'E' => [
				'name'   => 'E',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Код цены',
					],
				]
			],
			'F' => [
				'name'   => 'F',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Код типа суммы',
					],
					[
						'label' => 'Код валюты',
					],
					[
						'label' => 'Сумма',
					],
					[
						'label' => 'Код типа количества',
					],
					[
						'label' => 'Количество',
					],
				]
			],
			'J' => [
				'name'   => 'J',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Код типа суммы',
					],
					[
						'label' => 'Код валюты',
					],
					[
						'label' => 'Сумма',
					],
					[
						'label' => 'Код валюты',
					],
					[
						'label' => 'Сумма',
					],
				]
			],
			'K' => [
				'name'   => 'K',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Индексные пункты',
					],
				]
			],
		],
		'92a' => [
			'A' => [
				'name'   => 'A',
				'mask'   => ':4!c//[N]15d',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Знак',
					], [
						'label' => 'Ставка',
					],
				]
			],
			'B' => [
				'name'   => 'B',
				'mask'   => ':4!c/[8c]/4!c',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Код первой валюты',
					], [
						'label' => 'Код второй валюты',
					], [
						'label' => 'Курс',
					],
				]
			],
			'C' => [
				'name'   => 'C',
				'mask'   => ':4!c//[8c]/24x',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Система кодировки',
					], [
						'label' => 'Название ставки',
					],
				]
			],
			'D' => [
				'name'   => 'D',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Количество',
					], [
						'label' => 'Количество',
					],
				]
			],
			'E' => [
				'name'   => 'E',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Код типа ставки',
					], [
						'label' => 'Знак',
					], [
						'label' => 'Ставка',
					], [
						'label' => 'Статус ставки',
					],
				]
			],
			'F' => [
				'name'   => 'F',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Код валюты',
					], [
						'label' => 'Сумма',
					],
				]
			],
			'J' => [
				'name'   => 'J',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Система кодировки',
					], [
						'label' => 'Код типа ставки',
					], [
						'label' => 'Код валюты',
					], [
						'label' => 'Сумма',
					], [
						'label' => 'Статус ставки',
					],
				]
			],
			'K' => [
				'name'   => 'K',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Код типа ставки',
					],
				]
			],
			'L' => [
				'name'   => 'L',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Код первой валюты',
					], [
						'label' => 'Сумма',
					], [
						'label' => 'Код второй валюты',
					], [
						'label' => 'Сумма',
					],
				]
			],
			'M' => [
				'name'   => 'M',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Код валюты',
					], [
						'label' => 'Сумма',
					], [
						'label' => 'Количество',
					],
				]
			],
			'N' => [
				'name'   => 'B',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Количество',
					], [
						'label' => 'Код валюты',
					], [
						'label' => 'Сумма',
					],
				]
			],
		],
		'93a' => [
			'A' => [
				'name'   => 'A',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Система кодировки',
					], [
						'label' => 'Код типа остатка на субсчете',
					],
				]
			],
			'B' => [
				'name'   => 'B',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Система кодировки',
					], [
						'label' => 'Код типа количества',
					], [
						'label' => 'Знак',
					], [
						'label' => 'Остаток',
					],
				]
			],
			'C' => [
				'name'   => 'C',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Код типа количества',
					], [
						'label' => 'Код типа остатка',
					], [
						'label' => 'Знак',
					], [
						'label' => 'Остаток',
					],
				]
			],
		],
		'94a' => [
			'B' => [
				'name'   => 'B',
				'mask'   => ':4!c/[8c]/4!c[/30x]',
				'scheme' => [
					[
						'label'  => 'Определитель',
						'strict' => ['CLEA', 'TRAD'],
					], [
						'label' => 'Система кодировки',
					], [
						'label'  => 'Код места',
						'strict' => ['EXCH', 'OTCO', 'PRIM', 'SECM', 'VARI']
					], [
						'label' => 'Свободный текст',
					],
				]
			],
			'C' => [
				'name'   => 'C',
				'mask'   => ':4!c//2!a',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Код страны',
					],
				]
			],
			'D' => [
				'name'   => 'D',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Код страны',
					], [
						'label' => 'Место',
					],
				]
			],
			'F' => [
				'name'   => 'F',
				'mask'   => ':4!c//~4!c/~4!a2!a2!c[3!c]',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Код места',
					], [
						'label' => 'Идентификационный код',
					],
				]
			],
			'E' => [
				'name'   => 'E',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Адрес',
						'field' => 'textarea'
					],
				]
			],
			'H' => [
				'name'   => 'H',
				'mask'   => ':4!c//~4!a2!a2!c[3!c]',
				'scheme' => [
					[
						'label' => 'Определитель',
					], [
						'label' => 'Идентификационный код',
					],
				]
			],
		],
		'95a' => [
			'C' => [
				'name'   => 'C',
				'mask'   => ':4!c//2!a',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Код страны',
					]
				]
			],
			'P' => [
				'name'   => 'P',
				'mask'   => ':4!c//~4!a2!a2!c[3!c]',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Идентификационный код',
					]
				]
			],
			'Q' => [
				'name'   => 'Q',
				'mask'   => ':4!c//4*35x',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Наименование и адрес',
						'field' => 'textarea',
					]
				]
			],
			'R' => [
				'name'   => 'R',
				'mask'   => ':4!c/8c/34x',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Система кодировки',
					],
					[
						'label' => 'Собственный код',
					]
				]
			],
			'S' => [
				'name'   => 'S',
				'mask'   => ':4!c/[8c]/4c/2!a/30x',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Система кодировки',
					],
					[
						'label' => 'Тип идентификации',
					],
					[
						'label' => 'Код страны',
					],
					[
						'label' => 'Альтернативная идентификация',
					],
				]
			],
		],
		'97a' => [
			'A' => [
				'name'   => 'A',
				'mask'   => ':4!c//35x',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Номер счета',
					]
				]
			],
			'B' => [
				'name'   => 'B',
				'mask'   => ':4!c/[8c]/4!c/35x',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Система кодировки',
					],
					[
						'label' => 'Код типа счета',
					],
					[
						'label' => 'Номер счета',
					],
				]
			],
			'C' => [
				'name'   => 'C',
				'mask'   => ':4!c//2!a',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Код типа счета',
					],
				]
			],
			'E' => [
				'name'   => 'E',
				'mask'   => ':4!c//34x',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Международный номер банковского счета IBAN',
					],
				]
			],
		],
		'98a' => [
			'A' => [
				'name'   => 'A',
				'mask'   => ':4!c//8!n',
				'scheme' => [
					[
						'label'  => 'Определитель',
						//'strict' => ['PREP'] // в разных форматах разные значения
					],
					[
						'label' => 'Дата',
                        'name' => 'date',
					]
				]
			],
			'B' => [
				'name'   => 'B',
				'mask'   => ':4!c/[8c]/4!c',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Система кодировки',
					],
					[
						'label' => 'Код даты',
                        'name' => 'date',
					]
				]
			],
			'C' => [
				'name'   => 'C',
				'mask'   => ':4!c~//8!n~6!n',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Дата',
                        'name' => 'date',
					],
					[
						'label' => 'Время',
					]
				]
			],
			'E' => [
				'name'   => 'E',
				'mask'   => ':4!c//~8!n~6!n~[,3n]~[/[N]2!n[2!n]]',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Дата',
                        'name' => 'date',
					],
					[
						'label' => 'Время',
					],
					[
						'label' => 'Десятые доли',
					],
					[
						'label' => 'Значение времени UTC',
					]
				]
			],
			'F' => [
				'name'   => 'F',
				'type'   => 'sequence',
				'scheme' => [
					[
						'label' => 'Определитель',
					],
					[
						'label' => 'Система кодировки',
					],
					[
						'label' => 'Код даты',
                        'name' => 'date',
					],
					[
						'label' => 'Время',
					],
				]
			],
		],
	];

	if (!isset($tagScheme[$tag])) {
		$scheme = [
			$keys[0] => [
				'name'   => $keys[0],
				'type'   => 'sequence',
				'scheme' => [
					[
						#'name'  => (int)$tag.$keys[0],
						'label' => 'Ввод',
						'field' => 'textarea'
					]
				]
			]
		];
		return $scheme;
	}

	return array_intersect_key($tagScheme[$tag], array_fill_keys($keys, null));
}