<?php

namespace common\helpers;

abstract class Currencies
{
	protected static function data() {
		return [
			'RUB' => 'RUB', // 643 - РОССИЙСКИЙ РУБЛЬ
			'RUR' => 'RUR', // 810 - РОССИЙСКИЙ РУБЛЬ
			'EUR' => 'EUR', // 978 - ЕВРО
			'USD' => 'USD', // 840 - ДОЛЛАР США
			'CHF' => 'CHF', // 756 - ШВЕЙЦАРСКИЙ ФРАНК
			'CNY' => 'CNY', // 156 - КИТАЙСКИЙ ЮАНЬ
			'GBP' => 'GBP', // 826 - ФУНТ СТЕРЛИНГОВ
			'KZT' => 'KZT', // 398 - ТЕНГЕ (КАЗАХСКИЙ)
			'JPY' => 'JPY', // 392 - ЙЕНА
			// Прочие коды валют
			'AED' => 'AED', // 784 - ДИРХАМ (ОАЭ)
			'AFN' => 'AFN', // 971 - АФГАНИ
			'ALL' => 'ALL', // 008 - ЛЕК
			'AMD' => 'AMD', // 051 - АРМЯНСКИЙ ДРАМ
			'ANG' => 'ANG', // 532 - НИДЕРЛАНДСКИЙ АНТИЛЬСКИЙ ГУЛЬДЕН
			'AOA' => 'AOA', // 973 - КВАНЗА
			'ARS' => 'ARS', // 032 - АРГЕНТИНСКОЕ ПЕСО
			'AUD' => 'AUD', // 036 - АВСТРАЛИЙСКИЙ ДОЛЛАР
			'AWG' => 'AWG', // 533 - АРУБАНСКИЙ ФЛОРИН
			'AZN' => 'AZN', // 944 - АЗЕРБАЙДЖАНСКИЙ МАНАТ
			'BAM' => 'BAM', // 977 - КОНВЕРТИРУЕМАЯ МАРКА
			'BBD' => 'BBD', // 052 - БАРБАДОССКИЙ ДОЛЛАР
			'BDT' => 'BDT', // 050 - ТАКА
			'BGN' => 'BGN', // 975 - БОЛГАРСКИЙ ЛЕВ
			'BHD' => 'BHD', // 048 - БАХРЕЙНСКИЙ ДИНАР
			'BIF' => 'BIF', // 108 - БУРУНДИЙСКИЙ ФРАНК
			'BMD' => 'BMD', // 060 - БЕРМУДСКИЙ ДОЛЛАР
			'BND' => 'BND', // 096 - БРУНЕЙСКИЙ ДОЛЛАР
			'BOB' => 'BOB', // 068 - БОЛИВИАНО
			'BRL' => 'BRL', // 986 - БРАЗИЛЬСКИЙ РЕАЛ
			'BSD' => 'BSD', // 044 - БАГАМСКИЙ ДОЛЛАР
			'BTN' => 'BTN', // 064 - НГУЛТРУМ
			'BWP' => 'BWP', // 072 - ПУЛА
			'BYR' => 'BYR', // 974 - БЕЛОРУССКИЙ РУБЛЬ
			'BZD' => 'BZD', // 084 - БЕЛИЗСКИЙ ДОЛЛАР
			'CAD' => 'CAD', // 124 - КАНАДСКИЙ ДОЛЛАР
			'CDF' => 'CDF', // 976 - КОНГОЛЕЗСКИЙ ФРАНК
			'CLP' => 'CLP', // 152 - ЧИЛИЙСКОЕ ПЕСО
			'COP' => 'COP', // 170 - КОЛУМБИЙСКОЕ ПЕСО
			'COU' => 'COU', // 970 - ЕДИНИЦА РЕАЛЬНОЙ СТОИМОСТИ
			'CRC' => 'CRC', // 188 - КОСТАРИКАНСКИЙ КОЛОН
			'CUC' => 'CUC', // 931 - КОНВЕРТИРУЕМОЕ ПЕСО
			'CUP' => 'CUP', // 192 - КУБИНСКОЕ ПЕСО
			'CVE' => 'CVE', // 132 - ЭСКУДО КАБО-ВЕРДЕ
			'CZK' => 'CZK', // 203 - ЧЕШСКАЯ КРОНА
			'DJF' => 'DJF', // 262 - ФРАНК ДЖИБУТИ
			'DKK' => 'DKK', // 208 - ДАТСКАЯ КРОНА
			'DOP' => 'DOP', // 214 - ДОМИНИКАНСКОЕ ПЕСО
			'DZD' => 'DZD', // 012 - АЛЖИРСКИЙ ДИНАР
			'EGP' => 'EGP', // 818 - ЕГИПЕТСКИЙ ФУНТ
			'ERN' => 'ERN', // 232 - НАКФА
			'ETB' => 'ETB', // 230 - ЭФИОПСКИЙ БЫР
			'FJD' => 'FJD', // 242 - ДОЛЛАР ФИДЖИ
			'FKP' => 'FKP', // 238 - ФУНТ ФОЛКЛЕНДСКИХ ОСТРОВОВ
			'GEL' => 'GEL', // 981 - ЛАРИ
			'GHS' => 'GHS', // 936 - ГАНСКИЙ СЕДИ
			'GIP' => 'GIP', // 292 - ГИБРАЛТАРСКИЙ ФУНТ
			'GMD' => 'GMD', // 270 - ДАЛАСИ
			'GNF' => 'GNF', // 324 - ГВИНЕЙСКИЙ ФРАНК
			'GTQ' => 'GTQ', // 320 - КЕТСАЛЬ
			'GYD' => 'GYD', // 328 - ГАЙАНСКИЙ ДОЛЛАР
			'HKD' => 'HKD', // 344 - ГОНКОНГСКИЙ ДОЛЛАР
			'HNL' => 'HNL', // 340 - ЛЕМПИРА
			'HRK' => 'HRK', // 191 - ХОРВАТСКАЯ КУНА
			'HTG' => 'HTG', // 332 - ГУРД
			'HUF' => 'HUF', // 348 - ФОРИНТ
			'IDR' => 'IDR', // 360 - РУПИЯ
			'ILS' => 'ILS', // 376 - НОВЫЙ ИЗРАИЛЬСКИЙ ШЕКЕЛЬ
			'INR' => 'INR', // 356 - ИНДИЙСКАЯ РУПИЯ
			'IQD' => 'IQD', // 368 - ИРАКСКИЙ ДИНАР
			'IRR' => 'IRR', // 364 - ИРАНСКИЙ РИАЛ
			'ISK' => 'ISK', // 352 - ИСЛАНДСКАЯ КРОНА
			'JMD' => 'JMD', // 388 - ЯМАЙСКИЙ ДОЛЛАР
			'JOD' => 'JOD', // 400 - ИОРДАНСКИЙ ДИНАР
			'KES' => 'KES', // 404 - КЕНИЙСКИЙ ШИЛЛИНГ
			'KGS' => 'KGS', // 417 - СОМ
			'KHR' => 'KHR', // 116 - РИЕЛЬ
			'KMF' => 'KMF', // 174 - ФРАНК КОМОР
			'KPW' => 'KPW', // 408 - СЕВЕРОКОРЕЙСКАЯ ВОНА
			'KRW' => 'KRW', // 410 - ВОНА
			'KWD' => 'KWD', // 414 - КУВЕЙТСКИЙ ДИНАР
			'KYD' => 'KYD', // 136 - ДОЛЛАР ОСТРОВОВ КАЙМАН
			'LAK' => 'LAK', // 418 - КИП
			'LBP' => 'LBP', // 422 - ЛИВАНСКИЙ ФУНТ
			'LKR' => 'LKR', // 144 - ШРИ-ЛАНКИЙСКАЯ РУПИЯ
			'LRD' => 'LRD', // 430 - ЛИБЕРИЙСКИЙ ДОЛЛАР
			'LSL' => 'LSL', // 426 - ЛОТИ
			'LYD' => 'LYD', // 434 - ЛИВИЙСКИЙ ДИНАР
			'MAD' => 'MAD', // 504 - МАРОККАНСКИЙ ДИРХАМ
			'MDL' => 'MDL', // 498 - МОЛДАВСКИЙ ЛЕЙ
			'MGA' => 'MGA', // 969 - МАЛАГАСИЙСКИЙ АРИАРИ
			'MKD' => 'MKD', // 807 - ДЕНАР
			'MMK' => 'MMK', // 104 - КЬЯТ
			'MNT' => 'MNT', // 496 - ТУГРИК
			'MOP' => 'MOP', // 446 - ПАТАКА
			'MRO' => 'MRO', // 478 - УГИЯ
			'MUR' => 'MUR', // 480 - МАВРИКИЙСКАЯ РУПИЯ
			'MVR' => 'MVR', // 462 - РУФИЯ
			'MWK' => 'MWK', // 454 - КВАЧА
			'MXN' => 'MXN', // 484 - МЕКСИКАНСКОЕ ПЕСО
			'MYR' => 'MYR', // 458 - МАЛАЙЗИЙСКИЙ РИНГГИТ
			'MZN' => 'MZN', // 943 - МОЗАМБИКСКИЙ МЕТИКАЛ
			'NAD' => 'NAD', // 516 - ДОЛЛАР НАМИБИИ
			'NGN' => 'NGN', // 566 - НАЙРА
			'NIO' => 'NIO', // 558 - ЗОЛОТАЯ КОРДОБА
			'NOK' => 'NOK', // 578 - НОРВЕЖСКАЯ КРОНА
			'NPR' => 'NPR', // 524 - НЕПАЛЬСКАЯ РУПИЯ
			'NZD' => 'NZD', // 554 - НОВОЗЕЛАНДСКИЙ ДОЛЛАР
			'OMR' => 'OMR', // 512 - ОМАНСКИЙ РИАЛ
			'PAB' => 'PAB', // 590 - БАЛЬБОА
			'PEN' => 'PEN', // 604 - НОВЫЙ СОЛЬ
			'PGK' => 'PGK', // 598 - КИНА
			'PHP' => 'PHP', // 608 - ФИЛИППИНСКОЕ ПЕСО
			'PKR' => 'PKR', // 586 - ПАКИСТАНСКАЯ РУПИЯ
			'PLN' => 'PLN', // 985 - ЗЛОТЫЙ
			'PYG' => 'PYG', // 600 - ГУАРАНИ
			'QAR' => 'QAR', // 634 - КАТАРСКИЙ РИАЛ
			'RON' => 'RON', // 946 - НОВЫЙ РУМЫНСКИЙ ЛЕЙ
			'RSD' => 'RSD', // 941 - СЕРБСКИЙ ДИНАР
			'RWF' => 'RWF', // 646 - ФРАНК РУАНДЫ
			'SAR' => 'SAR', // 682 - САУДОВСКИЙ РИЯЛ
			'SBD' => 'SBD', // 090 - ДОЛЛАР СОЛОМОНОВЫХ ОСТРОВОВ
			'SCR' => 'SCR', // 690 - СЕЙШЕЛЬСКАЯ РУПИЯ
			'SDG' => 'SDG', // 938 - СУДАНСКИЙ ФУНТ
			'SEK' => 'SEK', // 752 - ШВЕДСКАЯ КРОНА
			'SGD' => 'SGD', // 702 - СИНГАПУРСКИЙ ДОЛЛАР
			'SHP' => 'SHP', // 654 - ФУНТ СВЯТОЙ ЕЛЕНЫ
			'SLL' => 'SLL', // 694 - ЛЕОНЕ
			'SOS' => 'SOS', // 706 - СОМАЛИЙСКИЙ ШИЛЛИНГ
			'SRD' => 'SRD', // 968 - СУРИНАМСКИЙ ДОЛЛАР
			'SSP' => 'SSP', // 728 - ЮЖНОСУДАНСКИЙ ФУНТ
			'STD' => 'STD', // 678 - ДОБРА
			'SVC' => 'SVC', // 222 - САЛЬВАДОРСКИЙ КОЛОН
			'SYP' => 'SYP', // 760 - СИРИЙСКИЙ ФУНТ
			'SZL' => 'SZL', // 748 - ЛИЛАНГЕНИ
			'THB' => 'THB', // 764 - БАТ
			'TJS' => 'TJS', // 972 - СОМОНИ
			'TMT' => 'TMT', // 934 - НОВЫЙ ТУРКМЕНСКИЙ МАНАТ
			'TND' => 'TND', // 788 - ТУНИССКИЙ ДИНАР
			'TOP' => 'TOP', // 776 - ПААНГА
			'TRY' => 'TRY', // 949 - ТУРЕЦКАЯ ЛИРА
			'TTD' => 'TTD', // 780 - ДОЛЛАР ТРИНИДАДА И ТОБАГО
			'TWD' => 'TWD', // 901 - НОВЫЙ ТАЙВАНЬСКИЙ ДОЛЛАР
			'TZS' => 'TZS', // 834 - ТАНЗАНИЙСКИЙ ШИЛЛИНГ
			'UAH' => 'UAH', // 980 - ГРИВНА
			'UGX' => 'UGX', // 800 - УГАНДИЙСКИЙ ШИЛЛИНГ
			'UYI' => 'UYI', // 940 - УРУГВАЙСКОЕ ПЕСО В ИНДЕКСИРОВАННЫХ ЕДИНИЦАХ
			'UYU' => 'UYU', // 858 - УРУГВАЙСКОЕ ПЕСО
			'UZS' => 'UZS', // 860 - УЗБЕКСКИЙ СУМ
			'VEF' => 'VEF', // 937 - БОЛИВАР
			'VND' => 'VND', // 704 - ДОНГ
			'VUV' => 'VUV', // 548 - ВАТУ
			'WST' => 'WST', // 882 - ТАЛА
			'XAF' => 'XAF', // 950 - ФРАНК КФА ВЕАС
			'XCD' => 'XCD', // 951 - ВОСТОЧНО-КАРИБСКИЙ ДОЛЛАР
			'XDR' => 'XDR', // 960 - СДР (СПЕЦИАЛЬНЫЕ ПРАВА ЗАИМСТВОВАНИЯ)
			'XOF' => 'XOF', // 952 - ФРАНК КФА ВСЕАО
			'XPF' => 'XPF', // 953 - ФРАНК КФП
			'YER' => 'YER', // 886 - ЙЕМЕНСКИЙ РИАЛ
			'ZAR' => 'ZAR', // 710 - РЭНД
			'ZMW' => 'ZMW', // 967 - ЗАМБИЙСКАЯ КВАЧА
			'ZWL' => 'ZWL', // 932 - ДОЛЛАР ЗИМБАБВЕ
		];
	}

	public static function getCodeLabels()
    {
		return self::data();
	}

	public static function getCodeLabelsExcept($excepts = [])
    {
		$data = self::data();
		foreach ($excepts as $value) {
			unset($data[$value]);
		}

        return $data;
	}

	/**
	 * @return array
	 */
	public static function getCodes()
    {
		return array_keys(self::data());
	}

	/**
	 * @param     $code
	 * @return string|null
	 */
	public static function getName($code)
    {
		$all = self::data();

		return array_key_exists($code, $all) ? $all[$code] : '';
	}

}
