<?php
/**
 * Секция 4 - ведения об оформлении, переводе и закрытии паспорта сделки
 */

?>

<div class="section section-4">
    <div class="section-header">4. Сведения об оформлении, переводе и закрытии паспорта сделки</div>
    <table class="crr-data">
        <tr>
            <td>№ п/п</td>
            <td>Регистрационный номер банка ПС</td>
            <td>Дата принятия паспорта сделки при его переводе</td>
            <td>Дата закрытия паспорта сделки</td>
            <td>Основание закрытия паспорта сделки</td>
        </tr>
        <tr>
            <td>1</td>
            <td>2</td>
            <td>3</td>
            <td>4</td>
            <td>5</td>
        </tr>
        <tr>
            <td></td>
            <td></td>
            <td>X</td>
            <td></td>
            <td></td>
        </tr>
    </table>
</div>
